---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeParameters
source: html/ff275d5f-5e4a-cac6-9570-60fc96b68160.htm
---
# RebarShapeParameters Methods

List all shape parameters used by all the existing RebarShapes in the specified document.